### Tutorial to concatenate in python
### https://deallen7.medium.com/how-to-use-pythons-equivalent-of-excel-s-concat-function-d645216428c5

In [1]:
import pandas as pd

df = pd.read_csv('../output_manipulation/archive/mls-salaries-2007.csv')

df.head()

  club last_name  first_name position  base_salary  guaranteed_compensation
0  CHI     Armas       Chris        M     225000.0                 225000.0
1  CHI    Banner     Michael        M      12900.0                  12900.0
2  CHI   Barrett        Chad        F      41212.5                  48712.5
3  CHI    Blanco  Cuauhtemoc        F    2492316.0                2666778.0
4  CHI     Brown        C.J.        D     106391.0                 106391.0

In [2]:
df['full_name'] = df.first_name + ' ' + df.last_name

df.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,full_name
0,CHI,Armas,Chris,M,225000.0,225000.0,Chris Armas
1,CHI,Banner,Michael,M,12900.0,12900.0,Michael Banner
2,CHI,Barrett,Chad,F,41212.5,48712.5,Chad Barrett
3,CHI,Blanco,Cuauhtemoc,F,2492316.0,2666778.0,Cuauhtemoc Blanco
4,CHI,Brown,C.J.,D,106391.0,106391.0,C.J. Brown

In [3]:
df['last_first'] = df.last_name + ' ' + df.first_name

df.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,full_name,last_first
0,CHI,Armas,Chris,M,225000.0,225000.0,Chris Armas,Armas Chris
1,CHI,Banner,Michael,M,12900.0,12900.0,Michael Banner,Banner Michael
2,CHI,Barrett,Chad,F,41212.5,48712.5,Chad Barrett,Barrett Chad
3,CHI,Blanco,Cuauhtemoc,F,2492316.0,2666778.0,Cuauhtemoc Blanco,Blanco Cuauhtemoc
4,CHI,Brown,C.J.,D,106391.0,106391.0,C.J. Brown,Brown C.J.

In [6]:
df['full_name_w_position'] = df.first_name + ' ' + df.last_name + '-' + df.position 

df.head()

,club,last_name,first_name,position,base_salary,guaranteed_compensation,full_name,last_first,full_name_w_position
0,CHI,Armas,Chris,M,225000.0,225000.0,Chris Armas,Armas Chris,Chris Armas-M
1,CHI,Banner,Michael,M,12900.0,12900.0,Michael Banner,Banner Michael,Michael Banner-M
2,CHI,Barrett,Chad,F,41212.5,48712.5,Chad Barrett,Barrett Chad,Chad Barrett-F
3,CHI,Blanco,Cuauhtemoc,F,2492316.0,2666778.0,Cuauhtemoc Blanco,Blanco Cuauhtemoc,Cuauhtemoc Blanco-F
4,CHI,Brown,C.J.,D,106391.0,106391.0,C.J. Brown,Brown C.J.,C.J. Brown-D